---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,Autodesk.Revit.DB.IFC.IFCData)
source: html/f2bcbc8f-58b7-b644-73ae-2713b456c4cd.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute Method

Sets the attribute value.

## Syntax (C#)
```csharp
public void SetAttribute(
	string name,
	IFCData value
)
```

## Parameters
- **name** (`System.String`) - The attribute name.
- **value** (`Autodesk.Revit.DB.IFC.IFCData`) - The value.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null